FLOWS = {
    "อาการปวด":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/ระดับความปวด ณ ปัจจุบัน Pain score/]
        B2[/ทานยาแก้ปวดแล้วดีขึ้นหรือไม่/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{Pain Score = 0 ?}
        C1 -->|ใช่| C2[ความเสี่ยงต่ำ]

        C1 -->|ไม่ใช่| C7{Pain Score ≥ 7 ?}
        C7 -->|ใช่| C8[ความเสี่ยงสูง]

        C7 -->|ไม่ใช่| C3{ทานยาแล้วดีขึ้นหรือไม่?}
        C3 -->|ดีขึ้น| C4[ความเสี่ยงต่ำ]
        C3 -->|ไม่ดีขึ้น| C5[ความเสี่ยงสูง]
        C3 -->|ยังไม่ได้ทาน| C6[ความเสี่ยงต่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[สรุป: Pain Score = 0]
        D2[สรุป: Pain Score < 7, ทานยาแล้วดีขึ้น → แนะนำ: ทานยาตามแผนเดิม]
        D3[สรุป: Pain Score < 7, ทานยาแล้วยังไม่ดีขึ้น → เสี่ยงสูง]
        D4[สรุป: Pain Score < 7, ยังไม่ได้ทานยา → แนะนำ: ทานยาแก้ปวดตามทันตแพทย์สั่ง]
        D5[สรุป: Pain Score ≥ 7 → เสี่ยงสูง]
    end

    C2 --> D1
    C4 --> D2
    C5 --> D3
    C6 --> D4
    C8 --> D5

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F
    D4 --> F
    D5 --> F
""",
    "อาการบวม":"""flowchart TD
A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

subgraph B [ข้อมูลที่ใช้ประเมิน]
    B1[/ระดับอาการบวมปัจจุบัน/]
    B2[/มีอาการหายใจลำบากหรือไม่/]
end

B --> C[ประเมินระดับความเสี่ยง]

subgraph C [ประเมินความเสี่ยง]
    C1{มีอาการหายใจลำบาก หรือ กลืนลำบากหรือไม่? }
    C1 -->|มี| C2[ความเสี่ยงสูง]
    C1 -->|ไม่มี| C3{ระดับอาการบวมปัจจุบัน}
    
    C3 -->|บวมมากขึ้นมากๆจนกระทบการใช้ชีวิต| C4[ความเสี่ยงสูง]
    C3 -->|บวมมากขึ้น| C5[ความเสี่ยงกลาง]
    C3 -->|บวมเท่าเดิม| C6[ความเสี่ยงต่ำ]
    C3 -->|บวมน้อยลง| C7[ความเสี่ยงต่ำ]
    C3 -->|หายบวมแล้ว| C8[ความเสี่ยงต่ำ]
end

C --> D[สร้างสรุปส่งพยาบาล]

subgraph D [สรุปส่งพยาบาล]
    D1[มีอาการหายใจลำบาก หรือ กลืนลำบาก→ เสี่ยงสูง, แนะนำ: ตัดลวดมัดฟัน และกลับมาพบทันตแพทย์โดยเร็ว]   
    D2[บวมมากขึ้นมากๆจนกระทบการใช้ชีวิตประจำวัน → เสี่ยงสูง]
    D3[บวมมากขึ้น → เสี่ยงกลาง, แนะนำ: ประคบอุ่นนอกช่องปาก และนอนยกศีรษะสูง 30°]
    D4[บวมเท่าเดิม → แนะนำ: ประคบอุ่นนอกช่องปาก และนอนยกศีรษะสูง 30°]
    D5[บวมน้อยลง → แนะนำ: ประคบอุ่นนอกช่องปาก และนอนยกศีรษะสูง 30°]
    D6[หายบวมแล้ว]
end

C2 --> D1
C4 --> D2
C5 --> D3
C6 --> D4
C7 --> D5
C8 --> D6

D1 --> F([สิ้นสุด])
D2 --> F
D3 --> F
D4 --> F
D5 --> F
D6 --> F""",
    "อาการเลือดซึม/ เลือดออก":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/อาการเลือดซึมหรือเลือดออก จากแผลในช่องปากหรือบริเวณจมูก/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{อาการเลือดออกระดับใด?}
        C1 -->|""ไม่มีเลือดซึมหรือไหลแล้ว""| C2[ความเสี่ยงต่ำ]
        C1 -->|""เลือดซึมแต่หยุดได้เอง""| C3[ความเสี่ยงต่ำ]
        C1 -->|""เลือดสีแดงสดไหลไม่หยุดปริมาณมาก""| C4[ความเสี่ยงสูง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""ไม่มีเลือดซึมหรือไหลแล้ว""]
        D2[""เลือดซึมแต่หยุดได้เอง → แนะนำ: ประคบเย็นนอกช่องปากและนอนยกศีรษะสูง""]
        D3[""เลือดสีแดงสดไหลไม่หยุดปริมาณมาก → เสี่ยงสูง, แนะนำ: กัดผ้าก๊อซให้แน่น(จากแผลในช่องปาก)หรือก้มหน้าและกดปีกจมูกเข้ากัน(จากจมูก) ร่วมกับประคบเย็นนอกช่องปากและกลับมาพบทันตแพทย์โดยเร็ว""]
    end

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "อาการไข้":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/อาการไข้/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{อาการไข้}
        C1 -->|""ไม่มีไข้""| C2[ความเสี่ยงต่ำ]
        C1 -->|""มีไข้ (มากกว่า 38 องศาเซลเซียส)""| C3[ความเสี่ยงสูง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""ไม่มีไข้""]
        D2[""มีไข้ → เสี่ยงสูง, แนะนำ: เช็ดตัว + ทานยาลดไข้(พาราเซตามอล) + **มาพบทันตแพทย์โดยเร็ว**""]
    end

    C2 --> D1
    C3 --> D2

    D1 --> F([สิ้นสุด])
    D2 --> F""",
    "บริเวณที่เอาเข็มน้ำเกลือออกที่หลังมือหรือข้อมือ (phlebitis)":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/บริเวณที่เอาเข็มน้ำเกลือออกที่หลังมือหรือข้อมือ/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{บริเวณที่เอาเข็มน้ำเกลือออกที่หลังมือหรือข้อมือ: phlebitis}
        C1 -->|""ไม่มีอาการปวด/บวม/แดง รอบรอยเข็ม""| C2[ความเสี่ยงต่ำ]
        C1 -->|""มีอาการปวด/บวม/แดง รอบรอยเข็ม""| C3[ความเสี่ยงกลาง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""ไม่มีphlebits""]
        D2[""มีอาการปวด/บวม/แดง รอบรอยเข็ม → เสี่ยงกลาง, แนะนำ: ประคบเย็นเพื่อลดปวด/ ประคบอุ่นเพื่อลดบวม ""]
    end

    C2 --> D1
    C3 --> D2

    D1 --> F([สิ้นสุด])
    D2 --> F""",
    "ไหมเย็บแผล":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/ไหมเย็บแผล/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{ไหมเย็บแผล}
        C1 -->|""ไหมแน่นดี / ไม่ได้สังเกต""| C2[ความเสี่ยงต่ำ]
        C1 -->|""ไหมหลุดหายไปบางส่วน แต่ไม่มีเลือดไหล""| C3[ความเสี่ยงต่ำ]
        C1 -->|""ไหมหลุดหายไปบางส่วน และมีอาการเลือดสีแดงสดไหล""| C4[ความเสี่ยงสูง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""ไหมแน่นดี / ไม่ได้สังเกต""]
        D2[""ไหมหลุดหายไปบางส่วน แต่ไม่มีเลือดไหล → แนะนำ: ห้ามเขี่ยหรือใช้ลิ้นดุนบริเวณแผล และแจ้งทันแพทย์หากมีความกังวล เช่น แผลแยก""]
        D3[""ไหมหลุดหายไปบางส่วน และมีอาการเลือดสีแดงสดไหลไม่หยุด → เสี่ยงสูง, แนะนำ: กัดผ้าก๊อซให้แน่นบริเวณที่เลือดไหล ร่วมกับประคบเย็นนอกช่องปาก และกลับมาพบทันตแพทย์โดยเร็ว""]
    end

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "อาการอื่นๆ (เลือกได้หลายคำตอบ)":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/อาการอื่นๆ<br>เลือกได้หลายคำตอบ/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{เลือกอาการใดบ้าง?}
        C1 -->|ปวดหน่วงบริเวณหน้าแก้ม ร่วมกับมีน้ำมูกสีเหลือง/เขียว เหม็นลงคอ| C2[ความเสี่ยงสูง]
        C1 -->|ช้ำ| C3[ความเสี่ยงต่ำ]
        C1 -->|ท้องเสีย| C4[ความเสี่ยงต่ำ]
        C1 -->|คัดแน่นจมูก| C5[ความเสี่ยงกลาง]
        C1 -->|มีน้ำมูก| C6[ความเสี่ยงต่ำ]
        C1 -->|มีเสมหะ| C7[ความเสี่ยงกลาง]
        C1 -->|เจ็บคอ| C8[ความเสี่ยงต่ำ]
        C1 -->|น้ำหนักลด| C9[ความเสี่ยงต่ำ]
        C1 -->|ปวดหัว| C10[ความเสี่ยงต่ำ]
        C1 -->|คลื่นไส้/อาเจียน| C11[ความเสี่ยงกลาง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D2[""ปวดหน่วงบริเวณหน้าแก้ม ร่วมกับมีน้ำมูกสีเหลือง/เขียว เหม็นลงคอ → เสี่ยงสูง, แนะนำ: งดการสั่งน้ำมูกใช้กระดาษทิชชู่ซับแทน""]
        D3[""ช้ำ → แนะนำ: ประคบอเย็นกรณีแผลฟกช้ำสีแดงอมม่วง หรือประคบอุ่นหากแผลฟกช้ำเริ่มเป็นสีเขียว โดยประคบนอกช่องปากบริเวณที่ช้ำ และกลับมาพบทันตแพทย์ทันทีหากมีอาการหายใจลำบาก""]
        D4[""ท้องเสีย → แนะนำ: ดื่มน้ำเกลือแร่เพื่อป้องกันภาวะขาดน้ำและเกลือแร่ และ อุ่นอาหาร ล้างมือเวลาเตรียมอาหาร""]
        D5[""คัดแน่นจมูก → เสี่ยงกลาง, แนะนำ: นอนยกศีรษะสูง 30° เลี่ยงอากาศเย็น""]
        D6[""มีน้ำมูก → แนะนำ: งดการสั่งน้ำมูก และใช้กระดาษทิชชู่ซับแทน""]
        D7[""มีเสมหะ → เสี่ยงกลาง แนะนำ: สูดหายใจเข้าเต็มที่และไอให้เสมหะออกมา จิบน้ำบ่อยๆ และหากมีอาการทางเดินหายใจมากขึ้นแนะนำตรวจ atk""]
        D8[""เจ็บคอ → แนะนำ: จิบน้ำบ่อยๆ และหากมีอาการทางเดินหายใจมากขึ้นแนะนำตรวจ atk""]
        D9[""น้ำหนักลด → แนะนำ: ทานอาหารเสริม เช่น นมเอนชัวร์/โปรตีนชง/ไก่ปั่น/ซุปฟักทอง ร่วมกับแบ่งทานอาหารหลายมื้อ""]          
        D10[""ปวดหัว → แนะนำ: ทานยาแก้ปวดตามทันตแพทย์สั่ง""]     
        D11[""คลื่นไส้/อาเจียน → เสี่ยงกลาง, แนะนำ: เมื่อมีอาการให้ตะแคงหน้าไปด้านใดด้านหนึ่งเพื่อป้องกันการสำลัก และตัดลวดมัดฟัน ร่วมกับปรึกษาพยาบาลเพื่อหาสาเหตุและแก้ไข""]
    end

    C2 --> D2
    C3 --> D3
    C4 --> D4
    C5 --> D5
    C6 --> D6
    C7 --> D7
    C8 --> D8
    C9 --> D9
    C10 --> D10
    C11 --> D11

    D2 --> F([สิ้นสุด])
    D3 --> F
    D4 --> F
    D5 --> F
    D6 --> F
    D7 --> F
    D8 --> F
    D9 --> F
    D10 --> F
    D11 --> F""",
    "รับประทานยาฆ่าเชื้อครบตามแผนการรักษาหรือไม่?":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/รับประทานยาฆ่าเชื้อครบตามแผนการรักษาหรือไม่?/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{รับประทานยาฆ่าเชื้อครบตามแผนการรักษาหรือไม่?}
        C1 -->|""ครบทุกเม็ด""| C2[ความเสี่ยงต่ำ]
        C1 -->|""ลืมทานบางครั้ง""| C3[ความเสี่ยงต่ำ]
        C1 -->|""ไม่ได้ทานเลย""| C4[ความเสี่ยงกลาง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""ทานยาฆ่าเชื้อครบ""]
        D2[""ลืมทานยาฆ่าเชื้อบางครั้ง → แนะนำ: รีบทานทันทีที่นึกได้หากใกล้เวลาของมื้อถัดไปให้ข้ามมื้อที่ลืมและทานยาของมื้อถัดไปตามปกติโดยไม่ต้องเพิ่มขนาดยาเพื่อชดเชย""]
        D3[""ไม่ได้ทานยาฆ่าเชื้อเลย → เสี่ยงกลาง, แนะนำ: แจ้งให้ทันตแพทย์ทราบเพื่อประเมินปรับแผนการรักษา""]
    end

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "ประคบเย็น หรือ อุ่นอยู่หรือไม่?":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/ประคบเย็น หรือ อุ่นอยู่หรือไม่?/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{ประคบเย็น หรือ อุ่นอยู่หรือไม่?}
        C1 -->|""ประคบเย็นอยู่""| C2[ความเสี่ยงต่ำ]
        C1 -->|""ประคบอุ่นอยู่""| C3[ความเสี่ยงต่ำ]
        C1 -->|""ไม่ได้ประคบอะไรเลย""| C4[ความเสี่ยงค่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""ประคบเย็นอยู่ → แนะนำ: เปลี่ยนมาประคบอุ่น ยกเว้น เลือดซึม/เลือดออก/ช้ำสีแดงอมม่วง ให้ประคบเย็นนอกช่องปากต่อ""]
        D2[""ประคบอุ่นอยู่""]
        D3[""ไม่ได้ประคบอะไรเลย → แนะนำ: หากยังมีอาการบวมแนะนำประคบอุ่น หรือประคบเย็นกรณีมีเลือดซึม/เลือดออก/ช้ำสีแดงอมม่วง""]
    end

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "หากมีการมัดฟันบนและล่างเข้าด้วยกัน ลวดมัดฟันแน่นดีหรือไม่?":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B0[/มีการมัดฟันบนและล่างเข้าด้วยกัน โดยที่ไม่สามารถอ้าปากได้หรือไม่?<br>IMF: Intermaxillary fixation/]
        B1[/หากมีการมัดฟันบนและล่างเข้าด้วยกัน ลวด/ยางมัดฟันแน่นดีหรือไม่?/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C0{มีการมัดฟันบนและล่างเข้าด้วยกัน โดยที่ไม่สามารถอ้าปากได้หรือไม่?<br>IMF: Intermaxillary fixation}
        C0 -->|ไม่มี| Cend[ไม่มีการมัดฟัน]
        C0 -->|มี| C1{หากมีการมัดฟันบนและล่างเข้าด้วยกัน ลวด/ยางมัดฟันแน่นดีหรือไม่?}

        C1 -->|ลวด/ยางมัดฟันแน่นดี| C2[ความเสี่ยงต่ำ]
        C1 -->|ลวด/ยางมัดฟันหลวม อ้าปากได้เล็กน้อย| C3[ความเสี่ยงสูง]
        C1 -->|ยางมัดฟันขาดไปบางเส้น แต่ยังอ้าปากไม่ได้| C4[ความเสี่ยงต่ำ]
    end

    Cend --> F([สิ้นสุด])

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""ลวด/ยางมัดฟันแน่นดี""]
        D2[""ลวดมัดฟันหลวม อ้าปากได้เล็กน้อย → เสี่ยงสูง, แนะนำ: ติดต่อพยาบาลเพื่อทำการนัดหมายกับทันตแพทย์""]
        D3[""ยางมัดฟันขาดไปบางเส้น แต่ยังอ้าปากไม่ได้""]
    end   

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "แผลบริเวณสะโพก: การรักษาการแหว่งของสันเหงือกโดยการนำกระดูกสะโพกมาปลูก":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/แผลบริเวณสะโพก/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{แผลบริเวณสะโพก}
        C1 -->|""แผลแห้งดี""| C2[ความเสี่ยงต่ำ]
        C1 -->|""แผลยังไม่แห้ง""| C3[ความเสี่ยงกลาง]
        C1 -->|""แผลยังไม่แห้ง ร่วมกับมีอาการบวม/แดง/มีหนอง""| C4[ความเสี่ยงสูง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""แผลบริเวณสะโพกแห้งดี""]
        D2[""แผลบริเวณสะโพกยังไม่แห้ง → เสี่ยงกลาง, แนะนำ: ทำความสะอาดแผลด้วยน้ำเกลือ และ เลี่ยงการอาบน้ำโดนบริเวณแผล ""]
        D3[""แผลยังไม่แห้ง ร่วมกับมีอาการบวม/แดง/มีหนอง → เสี่ยงสูง, แนะนำ: ทำความสะอาดแผลด้วยน้ำเกลือ และ เลี่ยงการอาบน้ำโดนบริเวณแผล""]
    end   

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "การเดิน: การรักษาการแหว่งของสันเหงือกโดยการนำกระดูกสะโพกมาปลูก":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/การเดิน ในผู้ป่วยที่ได้รับการรักษาโดยการนำกระดูกสะโพกมาปลูก /]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{การเดิน}
        C1 -->|""เดินได้คล่อง""| C2[ความเสี่ยงต่ำ]
        C1 -->|""เดินไม่ถนัด""| C3[ความเสี่ยงต่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""เดินได้ปกติ""]
        D2[""เดินไม่ถนัด""]
    end   

    C2 --> D1
    C3 --> D2

    D1 --> F([สิ้นสุด])
    D2 --> F""",
    "ตำแหน่งสายยางให้อาหาร: กรณีในผู้ป่วยที่รับประทานอาหารผ่านทางสายยาง (on NG-nasogastric tube)":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/ตำแหน่งสายยางให้อาหาร/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{ตำแหน่งสายยางให้อาหาร}
        C1 -->|""สายยางอยู่ในตำแหน่งเดิม,  เทปยึดจมูกกับสายแน่นดี ไม่เลื่อนหลุด""| C2[ความเสี่ยงต่ำ]
        C1 -->|""สายยางเลื่อนตำแหน่ง, เทปยึดจมูกกับสายไม่แน่น, เลื่อนหลุด""| C3[ความเสี่ยงสูง]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""สายยางอยู่ในตำแหน่งเดิม,  เทปยึดจมูกกับสายแน่นดี""]
        D2[""สายยางเลื่อนตำแหน่ง, เทปยึดจมูกกับสายไม่แน่น, เลื่อนหลุด → เสี่ยงสูง""]
    end   

    C2 --> D1
    C3 --> D2

    D1 --> F([สิ้นสุด])
    D2 --> F""",
    "การแปรงฟัน":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/การแปรงฟัน/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{การแปรงฟัน}
        C1 -->|""แปรงฟันได้""| C2[ความเสี่ยงต่ำ]
        C1 -->|""แปรงฟันไม่ได้""| C3[ความเสี่ยงต่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""แปรงฟันได้""]
        D2[""แปรงฟันไม่ได้ → แนะนำ: ใช้แปรงสีฟันหัวเล็กขนนุ่มร่วมกับยาสีฟันที่ไม่แสบปาก แปรงเบาๆช้าๆและหลีกเลี่ยงการแปรงโดนเหงือกที่มีแผลโดยใช้น้ำเกลือฉีดล้างแทน""]
    end   

    C2 --> D1
    C3 --> D2

    D1 --> F([สิ้นสุด])
    D2 --> F""",
    "การบ้วนปาก":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/การบ้วนปาก/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{การบ้วนปาก}
        C1 -->|""บ้วนปากได้""| C2[ความเสี่ยงต่ำ]
        C1 -->|""บ้วนปากไม่ได้""| C3[ความเสี่ยงต่ำ]
        C1 -->|""ไม่ได้บ้วนปาก""| C4[ความเสี่ยงต่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""บ้วนปากได้""]
        D2[""บ้วนปากไม่ได้""]
        D3[""ไม่ได้บ้วนปาก → แนะนำ: บ้วนปากเบาๆด้วยน้ำเปล่าจามด้วยน้ำยาบ้วนปาก ทุกครั้งหลังทานอาหาร""]
    end   

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "วิธีการรับประทานอาหาร":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/วิธีการรับประทานอาหาร/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{วิธีการรับประทานอาหาร}
        C1 -->|""รับประทานอาหารผ่านกระบอกฉีดยา (syringe)""| C2[ความเสี่ยงต่ำ]
        C1 -->|""รับประทานอาหารผ่านสายยาง (nasogastric tube)""| C3[ความเสี่ยงต่ำ]
        C1 -->|""รับประทานอาหารได้ปกติ""| C4[ความเสี่ยงต่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""รับประทานอาหารผ่าน syringe""]
        D2[""on NG tube""]
        D3[""รับประทานอาหารได้ปกติ""]
    end   

    C2 --> D1
    C3 --> D2
    C4 --> D3

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F""",
    "ประเภทอาหารที่ทาน (สามารถเลือกได้หลายคำตอบ)":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/ประเภทอาหารที่ทาน/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{ประเภทอาหารที่ทาน}
        C1 -->|""อาหารเหลวใสไม่มีกาก เช่น น้ำซุปใส น้ำผลไม้กรอง นม""| C2[ความเสี่ยงต่ำ]
        C1 -->|""อาหารปั่นเหลวมีกาก เช่น โจ๊กปั่นเหลว ไก่ปั่น""| C3[ความเสี่ยงต่ำ]
        C1 -->|""อาหารอ่อน เช่น โจ๊ก ข้าวต้ม ไข่ลวก ผักนึ่ง""| C4[ความเสี่ยงต่ำ]
        C1 -->|""อาหารปกติแต่เว้นอาหารรสจัด เผ็ด ร้อน แข็ง เหนียว""| C5[ความเสี่ยงต่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""อาหารเหลวใสไม่มีกาก""]
        D2[""อาหารปั่นเหลวมีกาก""]
        D3[""อาหารอ่อน""]
        D4[""อาหารปกติแต่เว้นอาหารรสจัด เผ็ด ร้อน แข็ง เหนียว""]
    end   

    C2 --> D1
    C3 --> D2
    C4 --> D3
    C5 --> D4

    D1 --> F([สิ้นสุด])
    D2 --> F
    D3 --> F
    D4 --> F""",
    "ปริมาณอาหารที่ทาน":"""flowchart TD
    A([เริ่มต้น]) --> B[บันทึกข้อมูลจาก Google Form]

    subgraph B [ข้อมูลที่ใช้ประเมิน]
        B1[/ปริมาณอาหารที่ทาน/]
    end

    B --> C[ประเมินระดับความเสี่ยง]

    subgraph C [ประเมินความเสี่ยง]
        C1{ปริมาณอาหารที่ทาน}
        C1 -->|""รับประทานอาหารปริมาณปกติ""| C2[ความเสี่ยงต่ำ]
        C1 -->|""รับประทานอาหารได้น้อยลง""| C3[ความเสี่ยงต่ำ]
    end

    C --> D[สร้างสรุปส่งพยาบาล]

    subgraph D [สรุปส่งพยาบาล]
        D1[""รับประทานอาหารปริมาณปกติ""]
        D2[""รับประทานอาหารได้น้อยลง → แนะนำ: ทานอาหารเสริม เช่น นมเอนชัวร์ ร่วมกับ แบ่งทานอาหารหลายมื้อ""]
    end   

    C2 --> D1
    C3 --> D2

    D1 --> F([สิ้นสุด])
    D2 --> F"""


    
}

if __name__ == '__main__':
    print(FLOWS.keys())
    print(len(FLOWS.keys()    ))
    for i in FLOWS.keys():
        print(i)